/*
AZ制造(带有#的函数不是啊这制造的)
函数：
jx(x)   阶乘（整数）
yhsj(m,n)    杨辉三角(第m行第n列)
jhzh(x)    角度转弧度
jhzh(x)    弧度转角度
azsin(h)    sin(x) (弧度)  (泰勒展开)
ex(g)       eˣ   e^x    (泰勒展开)
azln(g)        ln(x)  (泰勒展开)
kf(x)   开平方(整数)
jiexiys(jiexishi,x,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12)    解析式计算函数[
jiexiys(解析式,x,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12)   x到x12表示变量的值,用出现先后顺序赋值
或 jiexiys(解析式,[x,x1,x2,x3,....,x100,x101,x102,.....])   用数组表示
内置函数:sin,cos,tan,arcsin,arccos,arctan,sqrt,log,abs,ln,Gamma
运算符号:^/*+_   (减法用_表示,负数用-表示)
内置参数:π,e,γ,β*,φ  使用pi表示π,e表示e,ol表示γ,hj表示φ,et表示β*
]
isInArray(arr,value)     检查数组是否包含指定字符串#
arrremove(arr, item)      数组删除内指定字符串#
lft(x)       立方体函数(x层的立方体堆的个数)
gmu(x)           伽马函数  (微积分)
az_en_cn(src)    啊这翻译 英译中
az_cn_en(src)    啊这翻译 中译英
az_hz_py(src)    啊这汉字转拼音
accAdd(arg1, arg2)     精确加法#
accSub(arg1, arg2)     精确减法#
accMul(arg1, arg2)     精确乘法#
accDiv(arg1, arg2)     精确除法#
toCode (str)        加密字符串#
fromCode (str)      解密字符串#
zfc_to_sz(lb)       字符串转数组  返回数组
sz_to_zfc(sz)       数组转字符串  返回字符串
md5(string)        MD5运算#
l(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,r,s,t,u,v,w,x,y,z)   console.log()
qd_fqd(jxs,mod)      对于最简整式的求导和反向求导 (测试)
lglrcz(src)      拉格朗日插值 输入经过的点坐标 例:"(1,1);(2,3);(4,5)"



*/
var abc=["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
var num=["0","9","8","7","6","5","4","3","2","1",".","-"]
var en=[" ","!","az","\"","'",":","?",",",".","the","be","am","is","are","fuck","I","me","my","hello","ah","world","aha","love","silent","silently","safety","safe","fix","order","as","expensive","ouch","Australia","Aussie","Macao","eight","August","Paris","Brazil","dad","white","daytime","hundred","department","million","Berlin","class","office","Bondy","help","evening","baseball","pound","keep","newspaper","complain","cup","sad","north","northern","nose","than","comparison","comparative","Belgium","rate","pizza","match","competition","player","must","necessary","graduate","fireplace","avoid","resort","side","edge","rim","firecrackers","cap","bianshi","note","cheap","become","change","throughout","puntuation","sign","label","expression","form","performance","other","else","ice","carving","cream","iceberg","byside","leave","patient","dial","Boston","glass","neck","museum","not","no","restless","uneasy","jumper","unknown","so-so","missing","unhealthy","soon","impossible","unusual","difference","different","dislike","unlucky","cloth","Brussels","part","rub","guess","suppose","tailor","judge","menu","join","dining-room","playground","operate","noisy","noise","grass","toilet","fork","tea","teapot","realize","long","stocking","taste","best-seller","sing","chant","copy","past","supermarket","towards","moist","wet","station","display","statement","weigh","success","found","adult","member","castle","city","town","by","canoe","passenger","multiply","eat","pool","late","size","ruler","rush","surf","surfing","surfer","worm","pet","exit","out","born","aloud","appear","taxi","except","unless","kitchen","wear","spread","leaflet","pass","traditional","fax","window","bed","blow","spring","tape","since","moment","from","never","hurry","clever","rough","type","careless","carelessly","village","mistake","wrong","reply","hit","pack","call","open","broke","break","clean","printer","type","avenue","big","large","heavily","mainland","gate","rice","loud","loudly","hall","elephant","laugh","capital","UNIVERSIADE","popular","pronoun","instead","bring","one-way","single","worry","worried","but","cake","certainly","island","pour","empty","collapse","fall","to","into","onto","everywhere","arrive","reach","road","get","score","Germany","German","sure","lantern","check-in","wait","room","low","enemy","bottom","floor","place","geography","ground","globe","map","underground","earthquake","address","number","eighth","second","twentieth","twenty-first","ninth","third","eighteenth","twelfth","fourth","fifth","first","telegraph","fridge","battery","phone","telephone","beeper","computer","TV","lift","film","movie","cinema","electronic","e-mail","carve","fishing","survey","spoon","modem","drop","top","order","lose","lost","northeast","east","Tokyo","thing","winter","animal","zoo","hole","all","steep","tofu","unique","alone","jealous","short","sock","pile","team","captain","sorry","right","dialogue","Toronto","how","snowy","rainy","cloudy","hide","Russia","Russian","er","son","ear","two","secondhand","February","launch","engine","shine","invent","invention","inventor","happen","send","find","discover","style","sprout","pronounce","develop","dull","France","French","Frenchman","translate","restaurant","prevent","disturb","roof","room","house","visit","visitor","put","relax","fly","aeroplane","plane","airport","very","Africa","fat","soap","waste","TB","play","classify","share","minute","tomb","pink","wind","kite","crazy","honey","couple","Mrs.","waiter","symbol","parents","father","pay","woman","women","Bunny","retell","plural","review","adverb","cover","improve","rewrite","correct","dry","berry","pole","dare","Thanksgiving","grateful","thankful","feel","thank","interested","just","pen","piano","tall","high","height","golf","pleasure","delighted","glad","pleased","happily","loudspeaker","tell","arm","song","singer","opera","personal","each","give","to","follow","more","better","worse","less","farther","earlier","factory","project","engineer","tool","worker","job","work","workplace","station","stop","public","rooster","bus","kilo","fair","company","flat","park","palace","contribution","dog","buy","shopping","lonely","ancient","classical","barn","encourage","story","employee","melon","turning","close","shut","critical","closed","about","opinion","champion","washroom","light","widely","ad","rule","regular","track","rail","ghost","stick","chess","national","juice","course","Harvard","poster","seal","undersea","dolphin","channel","seafood","ocean","sea","afraid","scared","shy","hamburger","drought","flight","grand","well","good","OK","fine","several","hooray","seem","kind-hearted","reasonable","suitable","contract","teamwork","when","and","with","bank","walnut","blackboard","black","hey","quite","terrific","probably","hmn","across","bake","red","flood","monkey","later","thick","shout","breathe","fox","pepper","carrot","pot","lake","nurse","passport","flower","spend","garden","Washington","skate","roller-skating","funny","ski","fossil","chemistry","costume","boating","divide","paddle","draw","painter","topic","Waikiki","bad","cheer","yippee","welcome","yet","environment","sick","yellow","butter","grey","back","answer","return","conversation","interview","meet","meeting","dim","wedding","up","mix","activity","moving","alive","fire","train","turkey","rocket","Honolulu","partner","or","load","winner","hungry","chance","machine","robot","mechanical","chicken","egg","active","CD","jeep","region","disease","almost","hardly","plan","remember","mark","record","memory","journalist","mechanic","technology","season","continue","plus","Californian","Canada","Canadian","jacket","Canon","home","family","homework","housework","hometown","Beatles","price","cost","drive","steer","shelf","if","imagine","suppose","nut","shoulder","monitor","pick","minus","scissors","check","suggest","advice","build","building","health","healthy","healthily","keyboard","river","shall","would","should","nearly","future","will","prize","rainfall","traffic","reef","corner","hang","dumpling","foot","step","toe","stir","crow","yip","car","teach","coach","teacher","classroom","church","education","relay","receive","street","holiday","programme","festival","freeze","result","marry","ending","she","her","hers","herself","sister","solve","introduce","care","borrow","lend","today","tonight","metal","only","nervous","although","though","lately","progress","attack","enter","often","manager","experience","wonder","surprise","wonderful","exactly","spirit","scenery","policeman","police","warn","inspector","compete","mirror","nine","ninety","September","wine","lifeboat","live","orange","frustrated","sentence","huge","refuse","club","club","theatre","get-together","party","polyester","sharpener","decide","decision","grab","click","coffee","truck","beginning","bloom","Cairo","start","begin","look","beach","regard","see","gatekeeper","generosity","exam","examination","science","scientist","cough","take-away","coke","possible","terrible","mobile","may","could","lesson","textbook","desk","blank","empty","conditioner","space","air","scary","terrorist","dinosaur","pocket","mouth-to-mouth","thirsty","cry","skeleton","trousers","ladies","praise","cross","quick","fast","quickly","happy","chopstick","wide","insect","tie","difficulty","difficult","hard","bracket","rubbish","litter","dustbin","pull","candle","come","round-trip","column","blue","basketball","basket","lazy","wolf","wave","boss","old","tiger","mouse","band","boon","tired","cold","pear","away","off","leave","polite","politely","auditorium","gift","present","Richmond","understand","reason","history","adventure","Liverpool","example","connect","pity","league","face","practice","practise","exercise","cool","two-story","twice","both","neither","watchtower","neighbour","neighbourhood","ring","bell","zero","lead","exciting","boring","nice","another","yo-yo","singer","six","June","cage","deaf","stairway","earth","land","video","deer","way","path","journey","hotel","travel","trip","traveller","tourist","green","London","ship","turn","wheel","Rome","mum","mummy","trouble","horse","Makaha","bury","sell","full","Manchester","slow","slowly","busy","cat","writing-brush","sweater","hat","nobody","nothing","none","every","everybody","everyone","everything","cent","America","USA","American","beautiful","United-States","delicious","dollar","door","doormat","door-bell","bang","fan","riddle","rice","secret","secretary","code","bee","sheep","cotton","bread","flour","noodle","description","describe","fairs","name","bright","brightly","tomorrow","postcard","model","motorbike","magical","thriller","end","Moscow","Melbourne","Mexico","somebody","someone","something","hen","mother","board","wood","purpose","destination","witness","shepherd","hold","offer","take","which","that","there","those","grandma","cow","cream","shirt","boy","man","men","schoolboy","south","pumpkin","sadly","smelly","clock","can","energy","um","Nepal","nylon","your","yours","you","hi","yourselves","yourself","year","grade","age","young","bird","prefer","milk","beef","Newquay","farm","farmer","farmland","farming","shot","blouse","daughter","dress","girl","skirt","Ms","lady","madam","salesgirl","Europe","climb","row"]
var cn=[" ","！","啊这","“","'","：","？","，","。","这个","是","是","是","是","焯","我","我","我的","你好","啊","世界","啊哈","爱","安静的","安静地","安全","安全的","安装","按顺序","按照","昂贵的","嗷","澳大利亚","澳大利亚人","澳门","八","八月","巴黎","巴西","爸爸","白色的","白天","百","百货商店","百万","柏林","班级","办公室","邦戴","帮助","傍晚","棒球","磅","保持","报纸","抱怨","杯子","悲伤的","北方","北方的","鼻子","比","比较","比较级的","比利时","比例","比萨饼","比赛","比赛","比赛者","必须","必须的","毕业","壁炉","避免","避暑胜地","边","边","边缘","鞭炮","便帽","便士","便条","便宜的","变成","变换","遍及","标点符号","标记","标签","表达","表格","表演","别的","别的","冰","冰雕","冰激凌","冰山","并排","病假","病人","拨","波士顿","玻璃","脖子","博物馆","不","不","不安的","不安的","不按次序排队的人","不出名的","不好不坏的","不见的","不健康的","不久；很快","不可能的","不平常的","不同","不同的","不喜欢","不走运的","布","布鲁塞尔","部分","擦","猜","猜想","裁缝","裁判，法官","菜单","参加","餐厅","操场","操作","嘈杂的","嘈杂声","草","厕所","叉子","茶","茶壶","察觉","长的","长筒袜","尝味","畅销货","唱歌","唱诵","抄写","超过","超级市场","朝着","潮湿的","潮湿的","车站","陈列","陈述","称的重量","成就","成立","成年人","成员","城堡","城市","城镇","乘","乘独木舟","乘客","乘以","吃","池塘","迟的","尺寸","尺子","冲","冲浪","冲浪运动","冲浪者","虫","宠物","出口","出去","出生","出声地","出现","出租车","除之外","除非","厨房","穿着","传播","传单","传递","传统的","传真","窗子","床","吹","春天","磁带","此后","此刻","从","从来不","匆忙","聪明的","粗鲁的","粗体","粗心的","粗心地","村庄","错误","错误的","答复","打","打包","打电话","打开","打破","打破","打扫","打印机","打字","大道","大的","大的","大量地；猛烈地","大陆","大门","大米","大声的","大声地","大厅","大象","大笑","大写的","大学生运动会","大众的","代词","代替","带来","单程的","单一的","担心，使担心","担心的","但是","蛋糕","当然","岛屿","倒","倒空","倒塌","倒下","到","到里","到上","到处","到达","到达","道路","得到","得分","德国","德国人","的确","灯笼","登记处","等候","等候室","低的","敌人","底部","地板","地方","地理","地面","地球","地图","地下的","地震","地址","第号","第八","第二","第二十","第二十一","第九","第三","第十八","第十二","第四","第五","第一","电报","电冰箱","电池","电话","电话","电话传呼机","电脑","电视机","电梯","电影","电影","电影院","电子的","电子邮件","雕刻","钓鱼","调查","调羹","调制解调器","掉下","顶部","定货单","丢失","丢失的","东北","东方","东京","东西","冬天","动物","动物园","洞","都","陡峭的","豆腐","独特的","独自地","妒忌的","短的","短袜","堆","队","队长","对不起的","对的","对话","多伦多","多么","多雪的","多雨的","多云的","躲藏","俄国","俄国的","呃","儿子","耳朵","二","二手的","二月","发动","发动机","发光","发明","发明","发明家","发生","发送","发现:找到","发现","发型","发芽","发音","发展","乏味的","法国","法国的","法国人","翻译","饭馆","防止","妨碍","房顶","房间","房子","访问","访问者","放","放松","飞","飞机","飞机","飞机场","非常","非洲","肥胖的","肥皂","废物","肺结核","分角色表演","分类","分享","分钟","坟墓","粉红色","风","风筝","疯狂的","蜂蜜","夫妻","夫人","服务生","符号","父母","父亲","付钱","妇女","妇女","复活节兔子","复述","复数的","复习","副词","覆盖","改善","改写","改正","干的","干种子","杆子","敢于","感恩节","感激的","感激的","感觉","感谢","感兴趣的","刚","钢笔","钢琴","高的","高的","高度","高尔夫球","高兴","高兴的","高兴的","高兴的","高兴地","高音喇叭","告诉","胳臂","歌","歌唱者","歌剧","个人的","各个","给","根据","跟随","更多的","更好","更坏的","更少的","更远的","更早的","工厂","工程","工程师","工具","工人","工作","工作","工作场所","公车停靠站","公车停靠站","公共的","公鸡","公交车","公斤","公平的","公司","公寓","公园","宫殿","贡献","狗","购买","购物","孤独的","古代的","古典的","谷仓","鼓励","故事","雇员","瓜","拐弯处","关闭","关闭","关键的","关门的","关于；大约","观点","冠军","盥洗室","光","广泛地","广告","规则","规则的，定时的","轨道","轨道","鬼","棍棒","国际象棋","国家的","果汁","过程","哈佛大学","报","海豹","海底的","海豚","海峡","海鲜","海洋","海洋","害怕的","害怕的","害羞的","汉堡包","旱灾","航班","豪华，庄重的","好","好的","好的","好的:好的","好几个","好哇","好象","好心的","合理的","合适的","合同","合作","何时","和","和","河岸","核桃","黑板","黑的","嘿","很","很棒的","很可能","哼","横穿","烘烤","红的","洪水","猴子","后来","厚的","呼喊","呼吸","狐狸","胡椒","胡萝卜","壶","湖泊","护士","护照","花","花费；度过","花园","华盛顿","滑冰","滑旱冰","滑稽的","滑雪","化石","化学","化妆","划船","划分","划水","画","画家","话题","怀基基","坏的","欢呼","欢呼声","欢迎","还","环境","患病的","黄色的","黄油","灰色的","回","回答","回来","会话","会见","会见","会议","昏暗的","婚礼","混合","混合，混和","活动","活动的","活着的","火","火车","火鸡","火箭","火奴鲁鲁","伙伴","或者；否则","货物","获胜者","饥饿的","机会","机器","机器人","机械的","鸡","鸡蛋","积极的","激光唱片","吉普车","极地","疾病","几乎","几乎不","计划","记得","记号","记录","记忆存贮器","记者","技师","技术","季节","继续","加","加利福尼亚号","加拿大","加拿大人","夹克衫","佳能","家","家庭","家庭作业","家务","家乡","甲壳虫乐队","价格","价钱为","驾驶","驾驶","架子","假如","假设","假设","坚果","肩膀","监视器","捡起","减去","剪刀","检查","建议","建议，忠告","建造","建筑","健康","健康的","健康地","键盘","江河","将","将","将","将近","将来","将要","奖品","降水","交通","礁岩","角落","绞死","饺子","脚","脚步","脚趾","搅动","叫","叫喊","轿车","教","教练","教师","教室","教堂","教育","接力","接收","街道","节假日","节目","节日","结冰","结果","结婚","结尾","她","她","她的","她自己","姐","解决","介绍","介意","借","借","今天","今晚","金属","仅仅","紧张不安的","尽管","尽管","近来","进步","进攻","进入","经常","经理","经验","惊奇","惊奇","精彩的","精确地","精神","景色","警察","警察","警告","警官","竞争","镜子","九","九十","九月","酒","救生船","居住","橘子","沮丧的","句子","巨大的","拒绝","俱乐部","俱乐部","剧场","聚会","聚会","聚酯化合物","卷笔刀","决定","决定","攫取","咔哒声","咖啡","卡车","开端","开花","开罗","开始","开始:着手","看","海滩","待","看见","看门人","慷慨","考试","考试","科学","科学家","咳嗽","可带走的（熟食）","可口可乐","可能的","可怕的","可移动的","可以","可以","课","课本","课桌","空白处","空的","空调机","空间","空气","恐怖的","恐怖主义者","恐龙","口袋","口对口的","口渴的","哭","骷髅","裤子","酷妹","夸奖","跨越","快的","快的","快地","快乐的","筷子","宽的","昆虫","捆扎","困难","困难的","困难的","括号","垃圾","垃圾","垃圾箱","拉","蜡烛","来","来回的","栏目","蓝的","篮球","篮子","懒惰的","狼","浪","老板","老的","老虎","老鼠","乐队","雷声","累的","冷的","梨子","离开","离开","离开","礼貌的","礼貌地","礼堂","礼物","礼物","里士满","理解","理由","历史","历险，冒险","利物浦","例子","连接","怜悯","联盟","脸","练习","练习","练习","凉爽的","两层","两次","两者","两者都不","瞭望塔","邻居","邻里","铃响；打电话","铃子","零","领导","令人兴奋的","令人厌烦的","令人愉快的","另一，又一","溜溜球","流行歌手","六","六月","笼子","聋的","楼道","陆地","陆地","录象","鹿","路","路线","旅程","旅馆","旅行","旅行","旅行者","旅游者","绿色的","伦敦","轮船","轮流","轮子","罗马","妈妈","妈咪","麻烦","马","马卡哈","埋葬","卖","满的","曼彻斯特","慢的","慢慢地","忙的","猫","毛笔","毛衣","帽子","没有人","没有什么东西","没有一个人","每个","每个人","每个人","每件事","美分","美国","美国","美国的","美丽的","美利坚合众国","美味的","美元","门","门口的垫子","门铃","猛敲","迷、球迷、影迷","谜语","米","秘密","秘书","密码","蜜蜂","绵羊","棉花","面包","面粉","面条","描述","描述","庙会","名字","明亮的","明亮地","明天","明信片","模型","摩托车","魔法的","魔鬼","末梢","莫斯科","墨尔本","墨西哥","某人","某人","某事","母鸡","母亲","木板","木头","目的","目的地","目击者","牧羊人","拿","拿出","拿到","哪个","那个","那里","那些","奶奶","奶牛","奶油","男衬衫","男孩","男人","男人们","男生","南方","南瓜","难过地","难闻的","闹钟","能","能量","嗯","尼泊尔","尼龙","你的","你的","你","你好","你们自己","你自己","年","年级","年龄","年轻的","鸟","宁愿","牛奶","牛肉","纽基","农场","农民","农田","农业","努力","女衬衫","女儿","女服","女孩","女裙","女士","女士","女士","女售货员","欧洲","爬","排"]
var py=["a","啊","阿","呵","ai","埃","挨","哎","唉","哀","皑","蔼","矮","碍","爱","隘","癌","艾","an","鞍","氨","安","俺","按","暗","岸","胺","案","ang","肮","昂","盎","ao","凹","敖","熬","翱","袄","傲","奥","懊","澳","ba","芭","捌","叭","吧","笆","八","疤","巴","拔","跋","靶","把","坝","霸","罢","爸","扒","耙","bai","白","摆","佰","败","拜","柏","百","稗","伯","ban","斑","班","搬","扳","颁","板","版","扮","拌","伴","瓣","半","办","绊","般","bang","邦","帮","梆","榜","绑","棒","镑","傍","谤","膀","磅","蚌","bao","苞","胞","包","褒","雹","保","饱","宝","抱","报","豹","鲍","爆","剥","薄","暴","刨","炮","曝","瀑","堡","bei","杯","碑","悲","卑","北","辈","背","贝","钡","倍","狈","备","惫","焙","被","ben","奔","苯","本","笨","beng","崩","绷","甭","泵","蹦","迸","蚌","bi","逼","鼻","比","鄙","笔","彼","碧","蓖","蔽","毕","毙","毖","币","庇","痹","闭","敝","弊","必","壁","避","陛","辟","臂","秘","bian","鞭","边","编","贬","变","卞","辨","辩","辫","扁","便","遍","biao","标","彪","膘","表","bie","鳖","憋","别","瘪","bin","彬","斌","濒","滨","宾","摈","bing","兵","冰","柄","丙","秉","饼","炳","病","并","屏","bo","玻","菠","播","拨","钵","博","勃","搏","铂","箔","帛","舶","脖","膊","渤","驳","柏","剥","薄","波","泊","卜","般","伯","bu","捕","哺","补","埠","布","步","簿","部","怖","卜","不","埔","堡","ca","擦","cai","猜","裁","材","才","财","睬","踩","采","彩","菜","蔡","can","餐","残","惭","惨","灿","蚕","参","掺","cang","苍","舱","仓","沧","藏","cao","操","糙","槽","曹","草","ce","策","册","测","厕","侧","cen","参","ceng","层","蹭","曾","cha","插","叉","茶","碴","搽","察","岔","诧","茬","查","刹","喳","差","chai","柴","豺","拆","差","chan","搀","蝉","馋","谗","缠","铲","产","阐","颤","掺","单","chang","昌","猖","场","尝","常","偿","肠","厂","畅","唱","倡","长","敞","裳","chao","超","抄","钞","潮","巢","吵","炒","朝","嘲","绰","剿","che","扯","撤","掣","彻","澈","车","chen","郴","臣","辰","尘","晨","忱","沉","陈","趁","衬","橙","沈","称","秤","cheng","撑","城","成","呈","程","惩","诚","承","逞","骋","橙","乘","澄","盛","称","秤","chi","痴","持","池","迟","弛","驰","耻","齿","侈","赤","翅","斥","炽","吃","匙","尺","chong","充","冲","崇","宠","虫","重","chou","抽","酬","畴","踌","稠","愁","筹","仇","绸","瞅","丑","臭","chu","初","出","橱","厨","躇","锄","雏","滁","除","楚","础","储","矗","搐","触","处","畜","chuai","揣","chuan","川","穿","椽","船","喘","串","传","chuang","疮","窗","床","闯","创","chui","吹","炊","捶","锤","垂","椎","chun","春","椿","醇","唇","淳","纯","蠢","chuo","戳","绰","ci","疵","茨","磁","雌","辞","慈","瓷","词","此","刺","赐","次","伺","兹","差","cong","聪","葱","囱","匆","从","丛","cou","凑","cu","粗","醋","簇","促","卒","cuan","蹿","篡","窜","攒","cui","摧","崔","催","脆","瘁","粹","淬","翠","cun","村","存","寸","cuo","磋","搓","措","挫","错","撮","da","搭","达","答","瘩","打","大","dai","歹","傣","戴","带","殆","代","贷","袋","待","逮","怠","大","呆","dan","耽","担","丹","郸","胆","旦","氮","但","惮","淡","诞","蛋","掸","弹","石","单","dang","当","挡","党","荡","档","dao","刀","捣","蹈","倒","岛","祷","导","到","稻","悼","道","盗","de","德","得","的","地","dei","deng","蹬","灯","登","等","瞪","凳","邓","澄","di","低","滴","迪","敌","笛","狄","涤","嫡","抵","蒂","第","帝","弟","递","缔","的","堤","翟","底","地","提","dian","颠","掂","滇","碘","点","典","靛","垫","电","甸","店","惦","奠","淀","殿","佃","diao","碉","叼","雕","凋","刁","掉","吊","钓","调","die","跌","爹","碟","蝶","迭","谍","叠","ding","盯","叮","钉","顶","鼎","锭","定","订","丁","diu","丢","dong","东","冬","董","懂","动","栋","冻","洞","侗","恫","dou","兜","抖","斗","陡","豆","逗","痘","都","du","督","毒","犊","独","堵","睹","赌","杜","镀","肚","渡","妒","都","读","度","duan","端","短","锻","段","断","缎","dui","兑","队","对","堆","dun","墩","吨","钝","遁","蹲","敦","顿","囤","盾","duo","掇","哆","多","夺","垛","躲","朵","跺","剁","惰","度","舵","堕","e","峨","鹅","俄","额","讹","娥","厄","扼","遏","鄂","饿","阿","蛾","恶","哦","en","恩","er","而","耳","尔","饵","洱","二","贰","儿","fa","发","罚","筏","伐","乏","阀","法","珐","fan","藩","帆","翻","樊","矾","钒","凡","烦","反","返","范","贩","犯","饭","泛","番","繁","fang","坊","芳","方","肪","房","防","妨","仿","访","纺","放","fei","菲","非","啡","飞","肥","匪","诽","吠","肺","废","沸","费","fen","芬","酚","吩","氛","分","纷","坟","焚","汾","粉","奋","份","忿","愤","粪","feng","丰","封","枫","蜂","峰","锋","风","疯","烽","逢","缝","讽","奉","凤","冯","fo","佛","fou","否","fu","夫","敷","肤","孵","扶","辐","幅","氟","符","伏","俘","服","浮","涪","福","袱","弗","甫","抚","辅","俯","釜","斧","腑","府","腐","赴","副","覆","赋","复","傅","付","阜","父","腹","负","富","讣","附","妇","缚","咐","佛","拂","脯","ga","噶","嘎","夹","咖","gai","该","改","概","钙","溉","盖","芥","gan","干","甘","杆","柑","竿","肝","赶","感","秆","敢","赣","乾","gang","冈","刚","钢","缸","肛","纲","岗","港","杠","扛","gao","篙","皋","高","膏","羔","糕","搞","稿","镐","告","ge","哥","歌","搁","戈","鸽","疙","割","葛","格","阁","隔","铬","个","各","胳","革","蛤","咯","gei","给","gen","根","跟","geng","耕","更","庚","羹","埂","耿","梗","粳","颈","gong","工","攻","功","恭","龚","供","躬","公","宫","弓","巩","拱","贡","共","汞","gou","钩","勾","沟","苟","狗","垢","构","购","够","gu","辜","菇","咕","箍","估","沽","孤","姑","古","蛊","骨","股","故","顾","固","雇","鼓","谷","贾","gua","刮","瓜","剐","寡","挂","褂","guai","乖","拐","怪","guan","棺","关","官","冠","观","管","馆","罐","惯","灌","贯","纶","guang","光","逛","广","gui","瑰","规","圭","归","闺","轨","鬼","诡","癸","桂","柜","跪","贵","刽","硅","傀","炔","龟","gun","辊","滚","棍","guo","锅","郭","国","果","裹","过","涡","ha","蛤","哈","hai","骸","孩","海","氦","亥","害","骇","还","咳","han","酣","憨","邯","韩","含","涵","寒","函","喊","罕","翰","撼","捍","旱","憾","悍","焊","汗","汉","hang","杭","航","夯","吭","巷","行","hao","壕","嚎","豪","毫","郝","好","耗","号","浩","镐","貉","he","喝","荷","菏","禾","何","盒","阂","河","赫","褐","鹤","贺","核","合","涸","吓","呵","貉","和","hei","黑","嘿","hen","痕","很","狠","恨","heng","亨","横","衡","恒","哼","行","hong","轰","哄","烘","虹","鸿","洪","宏","弘","红","hou","喉","侯","猴","吼","厚","候","后","hu","呼","乎","忽","瑚","壶","葫","胡","蝴","狐","糊","湖","弧","虎","护","互","沪","户","唬","和","hua","花","华","猾","画","化","话","哗","滑","划","huai","槐","怀","淮","徊","坏","huan","欢","环","桓","缓","换","患","唤","痪","豢","焕","涣","宦","幻","还","huang","荒","慌","黄","磺","蝗","簧","皇","凰","惶","煌","晃","幌","恍","谎","hui","灰","挥","辉","徽","恢","蛔","回","毁","悔","慧","卉","惠","晦","贿","秽","烩","汇","讳","诲","绘","会","hun","昏","婚","魂","浑","混","荤","huo","活","伙","火","获","或","惑","霍","货","祸","豁","和","ji","击","圾","基","机","畸","积","箕","肌","饥","迹","激","讥","鸡","姬","绩","吉","极","棘","辑","籍","集","及","急","疾","汲","即","嫉","级","挤","几","脊","己","蓟","技","冀","季","伎","剂","悸","济","寄","寂","计","记","既","忌","际","妓","继","纪","给","稽","缉","祭","藉","期","奇","齐","系","jia","嘉","枷","佳","加","荚","颊","甲","钾","假","稼","架","驾","嫁","夹","贾","价","搅","茄","缴","家","jian","歼","监","坚","尖","笺","间","煎","兼","肩","艰","奸","缄","茧","检","柬","碱","拣","捡","简","俭","剪","减","荐","鉴","践","贱","键","箭","件","健","舰","剑","饯","渐","溅","涧","建","槛","见","浅","jiang","僵","姜","浆","江","疆","蒋","桨","奖","讲","匠","酱","将","降","强","jiao","椒","礁","焦","胶","交","郊","浇","骄","娇","脚","教","轿","较","叫","窖","蕉","嚼","搅","铰","狡","饺","绞","酵","觉","校","矫","侥","角","缴","剿","jie","揭","接","皆","秸","街","阶","截","劫","节","杰","捷","睫","竭","洁","结","姐","戒","界","借","介","疥","诫","届","桔","解","藉","芥","jin","巾","筋","斤","金","今","津","襟","紧","锦","仅","谨","进","靳","晋","禁","近","烬","浸","尽","劲","jing","荆","兢","茎","睛","晶","鲸","京","惊","精","经","井","警","静","境","敬","镜","径","痉","靖","竟","竞","净","劲","粳","景","颈","jiong","炯","窘","jiu","揪","究","纠","玖","韭","久","灸","九","酒","厩","救","旧","臼","舅","咎","就","疚","ju","鞠","拘","狙","疽","驹","菊","局","矩","举","沮","聚","拒","据","巨","具","距","踞","锯","俱","惧","炬","剧","车","桔","居","咀","句","蛆","足","juan","捐","鹃","娟","倦","眷","绢","卷","圈","jue","撅","攫","抉","掘","倔","爵","决","诀","绝","嚼","觉","角","jun","菌","钧","军","君","峻","俊","竣","郡","骏","均","浚","ka","喀","咖","卡","咯","kai","开","揩","凯","慨","楷","kan","刊","堪","勘","坎","砍","看","槛","嵌","kang","康","慷","糠","抗","亢","炕","扛","kao","考","拷","烤","靠","ke","坷","苛","柯","棵","磕","颗","科","可","渴","克","刻","客","课","壳","呵","咳","ken","肯","啃","垦","恳","keng","坑","吭","kong","空","恐","孔","控","kou","抠","口","扣","寇","ku","枯","哭","窟","苦","酷","库","裤","kua","夸","垮","挎","跨","胯","kuai","块","筷","侩","快","会","kuan","宽","款","kuang","匡","筐","狂","框","矿","眶","旷","况","kui","亏","盔","岿","窥","葵","奎","魁","馈","愧","傀","溃","kun","坤","昆","捆","困","kuo","扩","廓","阔","括","la","垃","拉","喇","辣","啦","蜡","腊","落","lai","莱","来","赖","lan","婪","栏","拦","篮","阑","兰","澜","谰","揽","览","懒","缆","烂","滥","蓝","lang","琅","榔","狼","廊","郎","朗","浪","lao","捞","劳","牢","老","佬","涝","姥","酪","烙","潦","落","le","勒","乐","肋","了","lei","雷","镭","蕾","磊","累","儡","垒","擂","类","泪","勒","肋","leng","楞","冷","棱","li","厘","梨","犁","黎","篱","狸","离","漓","理","李","里","鲤","礼","莉","荔","吏","栗","丽","厉","励","砾","历","利","例","俐","痢","立","粒","沥","隶","力","璃","哩","lia","lian","联","莲","连","镰","廉","涟","帘","敛","脸","链","恋","炼","练","怜","liang","粮","凉","梁","粱","良","两","辆","量","晾","亮","谅","俩","liao","撩","聊","僚","疗","燎","寥","辽","撂","镣","廖","料","潦","了","lie","列","裂","烈","劣","猎","lin","琳","林","磷","霖","临","邻","鳞","淋","凛","赁","吝","拎","ling","玲","菱","零","龄","铃","伶","羚","凌","灵","陵","岭","领","另","令","棱","怜","liu","溜","琉","榴","硫","馏","留","刘","瘤","流","柳","六","陆","long","龙","聋","咙","笼","窿","隆","垄","拢","陇","弄","lou","楼","娄","搂","篓","漏","陋","露","lu","芦","卢","颅","庐","炉","掳","卤","虏","鲁","麓","路","赂","鹿","潞","禄","录","戮","吕","六","碌","露","陆","绿","lv","驴","铝","侣","旅","履","屡","缕","虑","氯","律","滤","绿","率","lve","掠","略","luan","峦","挛","孪","滦","卵","乱","lun","抡","轮","伦","仑","沦","论","纶","luo","萝","螺","罗","逻","锣","箩","骡","裸","洛","骆","烙","络","落","咯","ma","妈","麻","玛","码","蚂","马","骂","嘛","吗","摩","抹","么","mai","买","麦","卖","迈","埋","脉","man","瞒","馒","蛮","满","曼","慢","漫","谩","埋","蔓","mang","茫","盲","氓","忙","莽","芒","mao","猫","茅","锚","毛","矛","铆","卯","茂","帽","貌","贸","冒","me","么","mei","玫","枚","梅","酶","霉","煤","眉","媒","镁","每","美","昧","寐","妹","媚","没","糜","men","门","闷","们","meng","萌","蒙","檬","锰","猛","梦","孟","盟","mi","眯","醚","靡","迷","弥","米","觅","蜜","密","幂","糜","谜","泌","秘","mian","棉","眠","绵","冕","免","勉","缅","面","娩","miao","苗","描","瞄","藐","秒","渺","庙","妙","mie","蔑","灭","min","民","抿","皿","敏","悯","闽","ming","明","螟","鸣","铭","名","命","miu","谬","mo","摸","摹","蘑","膜","磨","魔","末","莫","墨","默","沫","漠","寞","陌","脉","没","模","摩","抹","mou","谋","某","牟","mu","拇","牡","亩","姆","母","墓","暮","幕","募","慕","木","目","睦","牧","穆","姥","模","牟","na","拿","钠","纳","呐","那","娜","哪","nai","氖","乃","奶","耐","奈","哪","nan","南","男","难","nang","囊","nao","挠","脑","恼","闹","淖","ne","呢","哪","nei","馁","内","那","哪","nen","嫩","neng","能","ni","妮","霓","倪","泥","尼","拟","你","匿","腻","逆","溺","呢","nian","蔫","拈","年","碾","撵","捻","念","粘","niang","娘","酿","niao","鸟","尿","nie","捏","聂","孽","啮","镊","镍","涅","nin","您","ning","柠","狞","凝","宁","拧","泞","niu","牛","扭","钮","纽","nong","脓","浓","农","弄","nu","奴","怒","努","nv","女","nve","虐","疟","nuan","暖","nuo","挪","懦","糯","诺","娜","o","哦","ou","欧","鸥","殴","藕","呕","偶","沤","区","pa","啪","趴","爬","帕","怕","扒","耙","琶","pai","拍","排","牌","徘","湃","派","迫","pan","攀","潘","盘","磐","盼","畔","判","叛","番","胖","般","pang","乓","庞","耪","膀","磅","旁","胖","pao","抛","咆","袍","跑","泡","刨","炮","pei","呸","胚","培","裴","赔","陪","配","佩","沛","坏","pen","喷","盆","peng","砰","抨","烹","澎","彭","蓬","棚","硼","篷","膨","朋","鹏","捧","碰","pi","坯","砒","霹","批","披","劈","琵","毗","啤","脾","疲","皮","痞","僻","屁","譬","辟","否","匹","坏","pian","篇","偏","片","骗","扁","便","piao","飘","漂","瓢","票","朴","pie","撇","瞥","pin","拼","频","贫","品","聘","ping","乒","坪","萍","平","凭","瓶","评","苹","屏","po","坡","泼","颇","婆","破","粕","泊","迫","魄","朴","pou","剖","pu","扑","铺","仆","莆","葡","菩","蒲","圃","普","浦","谱","脯","埔","曝","瀑","堡","朴","qi","欺","戚","妻","七","凄","柒","沏","棋","歧","崎","脐","旗","祈","祁","骑","起","岂","乞","企","启","器","气","迄","弃","汽","讫","稽","缉","期","栖","其","奇","畦","齐","砌","泣","漆","契","qia","掐","卡","洽","qian","牵","扦","钎","千","迁","签","仟","谦","黔","钱","钳","前","潜","遣","谴","堑","欠","歉","铅","乾","浅","嵌","纤","qiang","枪","呛","腔","羌","墙","蔷","抢","强","qiao","锹","敲","悄","桥","乔","侨","巧","撬","翘","峭","俏","窍","壳","橇","瞧","鞘","雀","qie","切","窃","砌","茄","且","怯","qin","钦","侵","秦","琴","勤","芹","擒","禽","寝","亲","沁","qing","青","轻","氢","倾","卿","清","擎","晴","氰","情","顷","请","庆","亲","qiong","琼","穷","qiu","秋","丘","邱","球","求","囚","酋","泅","qu","趋","曲","躯","屈","驱","渠","取","娶","龋","去","区","蛆","趣","quan","颧","权","醛","泉","全","痊","拳","犬","券","劝","卷","圈","que","缺","瘸","却","鹊","榷","确","炔","雀","qun","裙","群","ran","然","燃","冉","染","rang","瓤","壤","攘","嚷","让","rao","饶","扰","绕","re","惹","热","ren","壬","仁","人","忍","韧","任","认","刃","妊","纫","reng","扔","仍","ri","日","rong","戎","茸","蓉","荣","融","熔","溶","容","绒","冗","rou","揉","柔","肉","ru","茹","儒","孺","如","辱","乳","汝","入","褥","蠕","ruan","软","阮","rui","蕊","瑞","锐","run","闰","润","ruo","弱","若","sa","撒","洒","萨","sai","腮","鳃","赛","塞","san","三","叁","伞","散","sang","桑","嗓","丧","sao","搔","骚","扫","嫂","梢","se","瑟","涩","塞","色","sen","森","seng","僧","sha","砂","杀","沙","纱","傻","啥","煞","莎","刹","杉","厦","shai","筛","晒","色","shan","珊","苫","山","删","煽","衫","闪","陕","擅","赡","膳","善","汕","扇","缮","杉","栅","掺","单","shang","墒","伤","商","赏","晌","上","尚","裳","汤","shao","捎","稍","烧","芍","勺","韶","少","哨","邵","绍","鞘","梢","召","she","奢","赊","舌","舍","赦","摄","慑","涉","社","设","蛇","拾","折","射","shei","shen","砷","申","呻","伸","身","深","绅","神","审","婶","肾","慎","渗","沈","甚","参","娠","什","sheng","声","生","甥","牲","升","绳","剩","胜","圣","乘","省","盛","shi","师","失","狮","施","湿","诗","尸","虱","十","时","蚀","实","史","矢","使","屎","驶","始","式","示","士","世","柿","事","拭","誓","逝","势","是","嗜","噬","适","仕","侍","释","饰","市","恃","室","视","试","匙","石","拾","食","识","氏","似","嘘","殖","峙","什","shou","收","手","首","守","寿","授","售","受","瘦","兽","熟","shu","蔬","枢","梳","殊","抒","输","叔","舒","淑","疏","书","赎","孰","薯","暑","曙","署","蜀","黍","鼠","述","树","束","戍","竖","墅","庶","漱","恕","熟","属","术","数","shua","刷","耍","shuai","摔","甩","帅","衰","率","shuan","栓","拴","shuang","霜","双","爽","shui","水","睡","税","谁","说","shun","吮","瞬","顺","舜","shuo","硕","朔","烁","数","说","si","斯","撕","嘶","私","司","丝","死","肆","寺","嗣","四","饲","巳","食","思","伺","似","song","松","耸","怂","颂","送","宋","讼","诵","sou","搜","擞","嗽","艘","su","苏","酥","俗","素","速","粟","僳","塑","溯","诉","肃","宿","缩","suan","酸","蒜","算","sui","虽","隋","随","绥","髓","碎","岁","穗","遂","隧","祟","尿","sun","孙","损","笋","suo","蓑","梭","唆","琐","索","锁","所","莎","缩","ta","塌","他","它","她","獭","挞","蹋","踏","塔","拓","tai","胎","苔","抬","台","泰","酞","太","态","汰","tan","坍","摊","贪","瘫","滩","坛","檀","痰","潭","谭","谈","坦","毯","袒","碳","探","叹","炭","弹","tang","塘","搪","堂","棠","膛","唐","糖","躺","淌","趟","烫","敞","汤","倘","tao","掏","涛","滔","绦","萄","桃","逃","淘","讨","套","陶","te","特","teng","藤","腾","疼","誊","ti","梯","剔","踢","锑","题","蹄","啼","体","替","嚏","惕","涕","剃","屉","提","tian","天","添","填","田","甜","恬","舔","腆","蚕","tiao","挑","条","迢","眺","跳","调","tie","贴","铁","帖","ting","厅","烃","汀","廷","停","亭","庭","挺","艇","听","tong","通","桐","酮","瞳","同","铜","彤","童","桶","捅","筒","统","痛","侗","恫","tou","偷","投","头","透","tu","秃","突","图","徒","途","涂","屠","土","吐","兔","凸","余","tuan","湍","团","tui","推","颓","腿","蜕","退","褪","tun","吞","屯","臀","囤","tuo","拖","托","脱","鸵","陀","驼","椭","妥","唾","驮","拓","wa","挖","哇","蛙","洼","娃","瓦","袜","wai","歪","外","wan","豌","弯","湾","玩","顽","丸","烷","完","碗","挽","晚","惋","婉","腕","蔓","皖","宛","万","wang","汪","王","枉","网","往","旺","望","忘","妄","亡","wei","威","巍","微","危","韦","违","桅","围","唯","惟","为","潍","维","苇","萎","委","伟","伪","纬","未","味","畏","胃","喂","魏","位","渭","谓","慰","卫","尾","蔚","尉","wen","瘟","温","蚊","文","闻","纹","吻","稳","紊","问","weng","嗡","翁","瓮","wo","挝","蜗","窝","我","斡","卧","握","沃","涡","wu","巫","呜","钨","乌","污","诬","屋","芜","梧","吾","吴","毋","武","五","捂","午","舞","伍","侮","坞","戊","雾","晤","物","勿","务","悟","误","恶","无","xi","昔","熙","析","西","硒","矽","晰","嘻","吸","锡","牺","稀","息","希","悉","膝","夕","惜","熄","烯","汐","犀","檄","袭","席","习","媳","喜","隙","细","栖","溪","铣","洗","系","戏","xia","瞎","匣","霞","辖","暇","峡","侠","狭","下","虾","厦","夏","吓","xian","掀","锨","先","仙","鲜","咸","贤","衔","舷","闲","涎","弦","嫌","显","险","现","献","县","腺","馅","羡","宪","陷","限","线","铣","纤","xiang","相","厢","镶","香","箱","襄","湘","乡","翔","祥","详","想","响","享","项","橡","像","向","象","降","巷","xiao","萧","硝","霄","哮","销","消","宵","晓","小","孝","肖","啸","笑","效","削","嚣","淆","校","xie","楔","些","歇","鞋","协","携","胁","谐","写","械","卸","蟹","懈","泄","泻","谢","屑","解","蝎","挟","邪","斜","血","叶","契","xin","薪","芯","锌","欣","辛","新","忻","心","衅","信","xing","星","腥","猩","惺","兴","刑","型","形","邢","醒","幸","杏","性","姓","省","行","xiong","兄","凶","胸","匈","汹","雄","熊","xiu","休","修","羞","朽","嗅","锈","秀","袖","绣","臭","宿","xu","墟","需","虚","须","徐","许","蓄","酗","叙","旭","序","恤","絮","婿","绪","续","戌","嘘","畜","吁","xuan","轩","喧","宣","悬","旋","玄","选","癣","眩","绚","xue","靴","薛","学","穴","雪","削","血","xun","勋","熏","循","旬","询","驯","巡","殉","汛","训","讯","逊","迅","浚","寻","ya","压","押","鸦","鸭","呀","丫","牙","蚜","衙","涯","雅","哑","亚","讶","芽","崖","轧","yan","焉","阉","淹","盐","严","研","蜒","岩","延","言","颜","阎","炎","沿","奄","掩","眼","衍","演","艳","堰","燕","厌","砚","雁","唁","彦","焰","宴","谚","验","铅","咽","烟","殷","yang","殃","央","鸯","秧","杨","扬","佯","疡","羊","洋","阳","氧","仰","痒","养","样","漾","yao","邀","腰","妖","瑶","摇","尧","遥","窑","谣","姚","咬","舀","药","要","耀","约","钥","侥","ye","椰","噎","耶","爷","野","冶","也","页","业","夜","咽","掖","叶","腋","液","拽","曳","yi","一","壹","医","揖","铱","依","伊","衣","颐","夷","移","仪","胰","疑","沂","宜","姨","彝","椅","蚁","倚","已","乙","矣","以","艺","抑","易","邑","亿","役","臆","逸","肄","疫","亦","裔","意","毅","忆","义","益","溢","诣","议","谊","译","异","翼","翌","绎","遗","屹","yin","茵","荫","因","音","阴","姻","吟","银","淫","寅","饮","尹","引","隐","印","殷","ying","英","樱","婴","鹰","应","缨","莹","萤","营","荧","蝇","迎","赢","盈","影","颖","硬","映","yo","哟","yong","拥","佣","臃","痈","庸","雍","踊","蛹","咏","泳","永","恿","勇","用","涌","you","幽","优","悠","忧","尤","由","邮","铀","犹","油","游","酉","有","友","右","佑","釉","诱","又","幼","yu","迂","淤","于","盂","榆","虞","愚","舆","逾","鱼","愉","渝","渔","隅","予","娱","雨","与","屿","禹","宇","语","羽","玉","域","芋","郁","遇","喻","峪","御","愈","欲","狱","誉","浴","寓","裕","预","豫","驭","尉","余","俞","吁","育","yuan","鸳","渊","冤","元","垣","袁","原","援","辕","园","圆","猿","源","缘","远","苑","愿","怨","院","员","yue","曰","越","跃","岳","粤","月","悦","阅","乐","约","钥","yun","耘","云","郧","匀","陨","允","运","蕴","酝","晕","韵","孕","均","员","za","匝","砸","杂","扎","咱","咋","zai","栽","哉","灾","宰","载","再","在","仔","zan","暂","赞","攒","咱","zang","赃","脏","葬","藏","zao","遭","糟","藻","枣","早","澡","蚤","躁","噪","造","皂","灶","燥","凿","ze","责","则","泽","择","侧","咋","zei","贼","zen","怎","zeng","增","憎","赠","曾","综","zha","渣","札","铡","闸","眨","榨","乍","炸","诈","查","扎","喳","栅","柞","轧","咋","zhai","斋","债","寨","翟","祭","择","摘","宅","窄","侧","zhan","瞻","毡","詹","沾","盏","斩","辗","崭","展","蘸","栈","占","战","站","湛","绽","颤","粘","zhang","樟","章","彰","漳","张","掌","涨","杖","丈","帐","账","仗","胀","瘴","障","长","zhao","招","昭","找","沼","赵","照","罩","兆","肇","朝","召","爪","着","zhe","遮","哲","蛰","辙","者","蔗","浙","折","锗","这","着","zhei","zhen","珍","斟","真","甄","砧","臻","贞","针","侦","枕","疹","诊","震","振","镇","阵","帧","zheng","蒸","挣","睁","征","狰","争","怔","整","拯","正","政","症","郑","证","zhi","芝","支","蜘","知","肢","脂","汁","之","织","职","直","植","执","值","侄","址","指","止","趾","只","旨","纸","志","挚","掷","至","致","置","帜","制","智","秩","稚","质","炙","痔","滞","治","窒","识","枝","吱","殖","峙","zhong","中","盅","忠","钟","衷","终","肿","仲","众","种","重","zhou","舟","周","州","洲","诌","轴","肘","帚","咒","皱","宙","昼","骤","粥","zhu","珠","株","蛛","朱","猪","诸","诛","逐","竹","烛","煮","拄","瞩","嘱","主","柱","助","蛀","贮","铸","筑","住","注","祝","驻","属","著","zhua","抓","爪","zhuai","拽","zhuan","专","砖","撰","篆","传","转","赚","zhuang","桩","庄","装","妆","壮","状","幢","撞","zhui","锥","追","赘","坠","缀","椎","zhun","谆","准","zhuo","捉","拙","卓","桌","茁","酌","啄","灼","浊","琢","缴","着","zi","咨","资","姿","滋","淄","孜","紫","籽","滓","子","自","渍","字","吱","兹","仔","zong","鬃","棕","踪","宗","总","纵","综","zou","邹","走","奏","揍","zu","租","族","祖","诅","阻","组","足","卒","zuan","钻","纂","zui","嘴","醉","最","罪","zun","尊","遵","zuo","昨","左","佐","做","作","坐","座","撮","琢","柞"]
var zh_cn="啊阿埃挨哎唉哀皑癌蔼矮艾碍爱隘鞍氨安俺按暗岸胺案肮昂盎凹敖熬翱袄傲奥懊澳芭捌扒叭吧笆八疤巴拔跋靶把耙坝霸罢爸白柏百摆佰败拜稗斑班搬扳般颁板版扮拌伴瓣半办绊邦帮梆榜膀绑棒磅蚌镑傍谤苞胞包褒剥薄雹保堡饱宝抱报暴豹鲍爆杯碑悲卑北辈背贝钡倍狈备惫焙被奔苯本笨崩绷甭泵蹦迸逼鼻比鄙笔彼碧蓖蔽毕毙毖币庇痹闭敝弊必辟壁臂避陛鞭边编贬扁便变卞辨辩辫遍标彪膘表鳖憋别瘪彬斌濒滨宾摈兵冰柄丙秉饼炳病并玻菠播拨钵波博勃搏铂箔伯帛舶脖膊渤泊驳捕卜哺补埠不布步簿部怖擦猜裁材才财睬踩采彩菜蔡餐参蚕残惭惨灿苍舱仓沧藏操糙槽曹草厕策侧册测层蹭插叉茬茶查碴搽察岔差诧拆柴豺搀掺蝉馋谗缠铲产阐颤昌猖场尝常长偿肠厂敞畅唱倡超抄钞朝嘲潮巢吵炒车扯撤掣彻澈郴臣辰尘晨忱沉陈趁衬撑称城橙成呈乘程惩澄诚承逞骋秤吃痴持匙池迟弛驰耻齿侈尺赤翅斥炽充冲虫崇宠抽酬畴踌稠愁筹仇绸瞅丑臭初出橱厨躇锄雏滁除楚础储矗搐触处揣川穿椽传船喘串疮窗幢床闯创吹炊捶锤垂春椿醇唇淳纯蠢戳绰疵茨磁雌辞慈瓷词此刺赐次聪葱囱匆从丛凑粗醋簇促蹿篡窜摧崔催脆瘁粹淬翠村存寸磋撮搓措挫错搭达答瘩打大呆歹傣戴带殆代贷袋待逮怠耽担丹单郸掸胆旦氮但惮淡诞弹蛋当挡党荡档刀捣蹈倒岛祷导到稻悼道盗德得的蹬灯登等瞪凳邓堤低滴迪敌笛狄涤翟嫡抵底地蒂第帝弟递缔颠掂滇碘点典靛垫电佃甸店惦奠淀殿碉叼雕凋刁掉吊钓调跌爹碟蝶迭谍叠丁盯叮钉顶鼎锭定订丢东冬董懂动栋侗恫冻洞兜抖斗陡豆逗痘都督毒犊独读堵睹赌杜镀肚度渡妒端短锻段断缎堆兑队对墩吨蹲敦顿囤钝盾遁掇哆多夺垛躲朵跺舵剁惰堕蛾峨鹅俄额讹娥恶厄扼遏鄂饿恩而儿耳尔饵洱二贰发罚筏伐乏阀法珐藩帆番翻樊矾钒繁凡烦反返范贩犯饭泛坊芳方肪房防妨仿访纺放菲非啡飞肥匪诽吠肺废沸费芬酚吩氛分纷坟焚汾粉奋份忿愤粪丰封枫蜂峰锋风疯烽逢冯缝讽奉凤佛否夫敷肤孵扶拂辐幅氟符伏俘服浮涪福袱弗甫抚辅俯釜斧脯腑府腐赴副覆赋复傅付阜父腹负富讣附妇缚咐噶嘎该改概钙盖溉干甘杆柑竿肝赶感秆敢赣冈刚钢缸肛纲岗港杠篙皋高膏羔糕搞镐稿告哥歌搁戈鸽胳疙割革葛格蛤阁隔铬个各给根跟耕更庚羹埂耿梗工攻功恭龚供躬公宫弓巩汞拱贡共钩勾沟苟狗垢构购够辜菇咕箍估沽孤姑鼓古蛊骨谷股故顾固雇刮瓜剐寡挂褂乖拐怪棺关官冠观管馆罐惯灌贯光广逛瑰规圭硅归龟闺轨鬼诡癸桂柜跪贵刽辊滚棍锅郭国果裹过哈骸孩海氦亥害骇酣憨邯韩含涵寒函喊罕翰撼捍旱憾悍焊汗汉夯杭航壕嚎豪毫郝好耗号浩呵喝荷菏核禾和何合盒貉阂河涸赫褐鹤贺嘿黑痕很狠恨哼亨横衡恒轰哄烘虹鸿洪宏弘红喉侯猴吼厚候后呼乎忽瑚壶葫胡蝴狐糊湖弧虎唬护互沪户花哗华猾滑画划化话槐徊怀淮坏欢环桓还缓换患唤痪豢焕涣宦幻荒慌黄磺蝗簧皇凰惶煌晃幌恍谎灰挥辉徽恢蛔回毁悔慧卉惠晦贿秽会烩汇讳诲绘荤昏婚魂浑混豁活伙火获或惑霍货祸击圾基机畸稽积箕肌饥迹激讥鸡姬绩缉吉极棘辑籍集及急疾汲即嫉级挤几脊己蓟技冀季伎祭剂悸济寄寂计记既忌际妓继纪嘉枷夹佳家加荚颊贾甲钾假稼价架驾嫁歼监坚尖笺间煎兼肩艰奸缄茧检柬碱碱拣捡简俭剪减荐槛鉴践贱见键箭件健舰剑饯渐溅涧建僵姜将浆江疆蒋桨奖讲匠酱降蕉椒礁焦胶交郊浇骄娇嚼搅铰矫侥脚狡角饺缴绞剿教酵轿较叫窖揭接皆秸街阶截劫节桔杰捷睫竭洁结解姐戒藉芥界借介疥诫届巾筋斤金今津襟紧锦仅谨进靳晋禁近烬浸尽劲荆兢茎睛晶鲸京惊精粳经井警景颈静境敬镜径痉靖竟竞净炯窘揪究纠玖韭久灸九酒厩救旧臼舅咎就疚鞠拘狙疽居驹菊局咀矩举沮聚拒据巨具距踞锯俱句惧炬剧捐鹃娟倦眷卷绢撅攫抉掘倔爵觉决诀绝均菌钧军君峻俊竣浚郡骏喀咖卡咯开揩楷凯慨刊堪勘坎砍看康慷糠扛抗亢炕考拷烤靠坷苛柯棵磕颗科壳咳可渴克刻客课肯啃垦恳坑吭空恐孔控抠口扣寇枯哭窟苦酷库裤夸垮挎跨胯块筷侩快宽款匡筐狂框矿眶旷况亏盔岿窥葵奎魁傀馈愧溃坤昆捆困括扩廓阔垃拉喇蜡腊辣啦莱来赖蓝婪栏拦篮阑兰澜谰揽览懒缆烂滥琅榔狼廊郎朗浪捞劳牢老佬姥酪烙涝勒乐雷镭蕾磊累儡垒擂肋类泪棱楞冷厘梨犁黎篱狸离漓理李里鲤礼莉荔吏栗丽厉励砾历利僳例俐痢立粒沥隶力璃哩俩联莲连镰廉怜涟帘敛脸链恋炼练粮凉梁粱良两辆量晾亮谅撩聊僚疗燎寥辽潦了撂镣廖料列裂烈劣猎琳林磷霖临邻鳞淋凛赁吝拎玲菱零龄铃伶羚凌灵陵岭领另令溜琉榴硫馏留刘瘤流柳六龙聋咙笼窿隆垄拢陇楼娄搂篓漏陋芦卢颅庐炉掳卤虏鲁麓碌露路赂鹿潞禄录陆戮驴吕铝侣旅履屡缕虑氯律率滤绿峦挛孪滦卵乱掠略抡轮伦仑沦纶论萝螺罗逻锣箩骡裸落洛骆络妈麻玛码蚂马骂嘛吗埋买麦卖迈脉瞒馒蛮满蔓曼慢漫谩芒茫盲氓忙莽猫茅锚毛矛铆卯茂冒帽貌贸么玫枚梅酶霉煤没眉媒镁每美昧寐妹媚门闷们萌蒙檬盟锰猛梦孟眯醚靡糜迷谜弥米秘觅泌蜜密幂棉眠绵冕免勉娩缅面苗描瞄藐秒渺庙妙蔑灭民抿皿敏悯闽明螟鸣铭名命谬摸摹蘑模膜磨摩魔抹末莫墨默沫漠寞陌谋牟某拇牡亩姆母墓暮幕募慕木目睦牧穆拿哪呐钠那娜纳氖乃奶耐奈南男难囊挠脑恼闹淖呢馁内嫩能妮霓倪泥尼拟你匿腻逆溺蔫拈年碾撵捻念娘酿鸟尿捏聂孽啮镊镍涅您柠狞凝宁拧泞牛扭钮纽脓浓农弄奴努怒女暖虐疟挪懦糯诺哦欧鸥殴藕呕偶沤啪趴爬帕怕琶拍排牌徘湃派攀潘盘磐盼畔判叛乓庞旁耪胖抛咆刨炮袍跑泡呸胚培裴赔陪配佩沛喷盆砰抨烹澎彭蓬棚硼篷膨朋鹏捧碰坯砒霹批披劈琵毗啤脾疲皮匹痞僻屁譬篇偏片骗飘漂瓢票撇瞥拼频贫品聘乒坪苹萍平凭瓶评屏坡泼颇婆破魄迫粕剖扑铺仆莆葡菩蒲埔朴圃普浦谱曝瀑期欺栖戚妻七凄漆柒沏其棋奇歧畦崎脐齐旗祈祁骑起岂乞企启契砌器气迄弃汽泣讫掐洽牵扦钎铅千迁签仟谦乾黔钱钳前潜遣浅谴堑嵌欠歉枪呛腔羌墙蔷强抢橇锹敲悄桥瞧乔侨巧鞘撬翘峭俏窍切茄且怯窃钦侵亲秦琴勤芹擒禽寝沁青轻氢倾卿清擎晴氰情顷请庆琼穷秋丘邱球求囚酋泅趋区蛆曲躯屈驱渠取娶龋趣去圈颧权醛泉全痊拳犬券劝缺炔瘸却鹊榷确雀裙群然燃冉染瓤壤攘嚷让饶扰绕惹热壬仁人忍韧任认刃妊纫扔仍日戎茸蓉荣融熔溶容绒冗揉柔肉茹蠕儒孺如辱乳汝入褥软阮蕊瑞锐闰润若弱撒洒萨腮鳃塞赛三叁伞散桑嗓丧搔骚扫嫂瑟色涩森僧莎砂杀刹沙纱傻啥煞筛晒珊苫杉山删煽衫闪陕擅赡膳善汕扇缮墒伤商赏晌上尚裳梢捎稍烧芍勺韶少哨邵绍奢赊蛇舌舍赦摄射慑涉社设砷申呻伸身深娠绅神沈审婶甚肾慎渗声生甥牲升绳省盛剩胜圣师失狮施湿诗尸虱十石拾时什食蚀实识史矢使屎驶始式示士世柿事拭誓逝势是嗜噬适仕侍释饰氏市恃室视试收手首守寿授售受瘦兽蔬枢梳殊抒输叔舒淑疏书赎孰熟薯暑曙署蜀黍鼠属术述树束戍竖墅庶数漱恕刷耍摔衰甩帅栓拴霜双爽谁水睡税吮瞬顺舜说硕朔烁斯撕嘶思私司丝死肆寺嗣四伺似饲巳松耸怂颂送宋讼诵搜艘擞嗽苏酥俗素速粟僳塑溯宿诉肃酸蒜算虽隋随绥髓碎岁穗遂隧祟孙损笋蓑梭唆缩琐索锁所塌他它她塔獭挞蹋踏胎苔抬台泰酞太态汰坍摊贪瘫滩坛檀痰潭谭谈坦毯袒碳探叹炭汤塘搪堂棠膛唐糖倘躺淌趟烫掏涛滔绦萄桃逃淘陶讨套特藤腾疼誊梯剔踢锑提题蹄啼体替嚏惕涕剃屉天添填田甜恬舔腆挑条迢眺跳贴铁帖厅听烃汀廷停亭庭挺艇通桐酮瞳同铜彤童桶捅筒统痛偷投头透凸秃突图徒途涂屠土吐兔湍团推颓腿蜕褪退吞屯臀拖托脱鸵陀驮驼椭妥拓唾挖哇蛙洼娃瓦袜歪外豌弯湾玩顽丸烷完碗挽晚皖惋宛婉万腕汪王亡枉网往旺望忘妄威巍微危韦违桅围唯惟为潍维苇萎委伟伪尾纬未蔚味畏胃喂魏位渭谓尉慰卫瘟温蚊文闻纹吻稳紊问嗡翁瓮挝蜗涡窝我斡卧握沃巫呜钨乌污诬屋无芜梧吾吴毋武五捂午舞伍侮坞戊雾晤物勿务悟误昔熙析西硒矽晰嘻吸锡牺稀息希悉膝夕惜熄烯溪汐犀檄袭席习媳喜铣洗系隙戏细瞎虾匣霞辖暇峡侠狭下厦夏吓掀锨先仙鲜纤咸贤衔舷闲涎弦嫌显险现献县腺馅羡宪陷限线相厢镶香箱襄湘乡翔祥详想响享项巷橡像向象萧硝霄削哮嚣销消宵淆晓小孝校肖啸笑效楔些歇蝎鞋协挟携邪斜胁谐写械卸蟹懈泄泻谢屑薪芯锌欣辛新忻心信衅星腥猩惺兴刑型形邢行醒幸杏性姓兄凶胸匈汹雄熊休修羞朽嗅锈秀袖绣墟戌需虚嘘须徐许蓄酗叙旭序畜恤絮婿绪续轩喧宣悬旋玄选癣眩绚靴薛学穴雪血勋熏循旬询寻驯巡殉汛训讯逊迅压押鸦鸭呀丫芽牙蚜崖衙涯雅哑亚讶焉咽阉烟淹盐严研蜒岩延言颜阎炎沿奄掩眼衍演艳堰燕厌砚雁唁彦焰宴谚验殃央鸯秧杨扬佯疡羊洋阳氧仰痒养样漾邀腰妖瑶摇尧遥窑谣姚咬舀药要耀椰噎耶爷野冶也页掖业叶曳腋夜液一壹医揖铱依伊衣颐夷遗移仪胰疑沂宜姨彝椅蚁倚已乙矣以艺抑易邑屹亿役臆逸肄疫亦裔意毅忆义益溢诣议谊译异翼翌绎茵荫因殷音阴姻吟银淫寅饮尹引隐印英樱婴鹰应缨莹萤营荧蝇迎赢盈影颖硬映哟拥佣臃痈庸雍踊蛹咏泳涌永恿勇用幽优悠忧尤由邮铀犹油游酉有友右佑釉诱又幼迂淤于盂榆虞愚舆余俞逾鱼愉渝渔隅予娱雨与屿禹宇语羽玉域芋郁吁遇喻峪御愈欲狱育誉浴寓裕预豫驭鸳渊冤元垣袁原援辕园员圆猿源缘远苑愿怨院曰约越跃钥岳粤月悦阅耘云郧匀陨允运蕴酝晕韵孕匝砸杂栽哉灾宰载再在咱攒暂赞赃脏葬遭糟凿藻枣早澡蚤躁噪造皂灶燥责择则泽贼怎增憎曾赠扎喳渣札轧铡闸眨栅榨咋乍炸诈摘斋宅窄债寨瞻毡詹粘沾盏斩辗崭展蘸栈占战站湛绽樟章彰漳张掌涨杖丈帐账仗胀瘴障招昭找沼赵照罩兆肇召遮折哲蛰辙者锗蔗这浙珍斟真甄砧臻贞针侦枕疹诊震振镇阵蒸挣睁征狰争怔整拯正政帧症郑证芝枝支吱蜘知肢脂汁之织职直植殖执值侄址指止趾只旨纸志挚掷至致置帜峙制智秩稚质炙痔滞治窒中盅忠钟衷终种肿重仲众舟周州洲诌粥轴肘帚咒皱宙昼骤珠株蛛朱猪诸诛逐竹烛煮拄瞩嘱主著柱助蛀贮铸筑住注祝驻抓爪拽专砖转撰赚篆桩庄装妆撞壮状椎锥追赘坠缀谆准捉拙卓桌琢茁酌啄着灼浊兹咨资姿滋淄孜紫仔籽滓子自渍字鬃棕踪宗综总纵邹走奏揍租足卒族祖诅阻组钻纂嘴醉最罪尊遵昨左佐柞做作坐座"






function jx(x){              //阶乘（整数）
    if (x==0){return 1 }
    var yscs=x
    for (var k=1;k<x;k++){
    var yscs=yscs*k
    }
    return yscs
    }
function yhsj(m,n){            //杨辉三角(需要阶乘)
    var lsbl=jx(n-1)*jx(m-n);
    return Math.round(jx(m-1)/lsbl);
    } 
function jhzh(x){               //角度转弧度
    return (x/180)*Math.PI
}
function jhzh(x){               //弧度转角度
    return (x/Math.PI)*180
}
    function azsin(h){         //sin(需要阶乘)
      var ds=0
      var g=h
      if(g>7){
        g=g%(2*Math.PI)
      }
    for(var i=0;i<100;i++){
      var yu=(2*i+1)
      var b=(Math.pow(g, yu)/jx(yu))*Math.pow(-1, i)
      //console.log(b)
      var ds=ds+b
    }
    return ds
    }
    function ex(g){                 //eˣ(需要阶乘)
      var ds=1
    for(var i=0;i<300;i++){
      var b=(Math.pow(g, i)/jx(i))
      //console.log(b)
      var ds=ds+b
    }
    return ds
    }
    function azln(g){                    //ln(x)
    var y=(g - 1) / (g + 1) 
    var ds=0
    for(var i=1;i<100;i=i+2){
      var b=(1/i)*Math.pow(y, i-1)
      var ds=ds+b
      //console.log(b)
    }
    var jg=2*y*ds
    return jg
    }
    function kf(x){             //开平方
        if(x<0){return NaN}
        if(x==0){return 0}
var rt=String(x).length
var a=2
if(rt%a>0){   //补位
    var ljs=""
    for(var po=0;po<(Math.floor(rt/a)+1)*a-rt;po++){
        var ljs=ljs+"0"
    }
    var c=ljs+String(x)
}else if(rt%a==0){
    var c=String(x)
}
var zzjg=0
var xsd=""

for(var fe=0;fe<1000;fe=fe+a){   //开始运算
  if(fe==0){
    var bjs=c.substring(0,a)
  }
    //console.log(bjs)
    for(var yp=0;yp<10;yp++){
       var du=Number(String(zzjg*a)+String(yp))
       //console.log(du)
        if(du*yp>Number(bjs)){
            break;
        }
    }
    //console.log((yp-1))
    var luo=Number(bjs)-(yp-1)*Number(String(zzjg*a)+String(yp-1))
    var zzjg=zzjg+String(yp-1)
    if(fe+a>=c.length){
        //var xsd=fe+a
        var ljs=""
        for(var po=0;po<a;po++){
            var ljs=ljs+"0"
        }
        var bjs=String(luo)+ljs
        //console.log(bjs)
    }else{
        var bjs=String(luo)+c.substring(fe+a,fe+a*a)
    }
}
var xsd=(c.length/a)+1          //添加小数点
    var sc=zzjg.substring(0,xsd)+"."+zzjg.substring(xsd,zzjg.length)
return Number(sc)
    }


    function jiexiys(jiexishi,x,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12){
      var yuanshizhifuc=String(jiexishi).toLowerCase()
      var diaoyongzifuchuang=yuanshizhifuc.replace(new RegExp('abs', 'g'), 'ab');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('sqrt', 'g'), 'sq');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('log', 'g'), 'lo');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('sin', 'g'), 'si');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('cos', 'g'), 'co');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('tan', 'g'), 'ta');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('arcsin', 'g'), 'as');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('arccos', 'g'), 'ac');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('arctan', 'g'), 'at');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('!', 'g'), 'gm');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp('gamma', 'g'), 'gm');
      var diaoyongzifuchuang=diaoyongzifuchuang.replace(new RegExp(' ', 'g'), '');

      var olhs=0.577215664901532860606512090082402431042159335  //γ
      var hjfg=0.61803398874989484820458683436563811  //φ
      var EmbreeTrefethen=0.70258  //β*
var blmlb=[]
var bllb=[]
if((x instanceof Array)==true){
  var blmlb=x
}else{
  blmlb.push(x);blmlb.push(x1);blmlb.push(x2);blmlb.push(x3);blmlb.push(x4);blmlb.push(x5);
  blmlb.push(x6);blmlb.push(x7);blmlb.push(x8);blmlb.push(x9);blmlb.push(x10);blmlb.push(x11);blmlb.push(x12);
}



      var diaoyongzifuchuang="("+diaoyongzifuchuang+")"
      //console.log(diaoyongzifuchuang)
      var zshs=false   //是否为函数括号
      
      var zuokuohao=0       //括号套了几层
      var youkuohao=0       //括号套了几层
for(var i=0;i<diaoyongzifuchuang.length;i++){
    var gh=diaoyongzifuchuang.substring(i,i+1)
    if(gh=="("){
      zuokuohao++
    }
    if(gh==")"){
      youkuohao++
    }
}
//console.log(zuokuohao,youkuohao)
if(zuokuohao==youkuohao){}else if(zuokuohao>youkuohao){    //检查括号
  return "err 少了"+String(zuokuohao-youkuohao)+"个“)”"
}else if(zuokuohao<youkuohao){
  return "err 多了"+String(youkuohao-zuokuohao)+"个“)”"
}
var ygblqiw=-1
for(var i=0;i<diaoyongzifuchuang.length;i++){          //获取变量名称
  var gh=diaoyongzifuchuang.substring(i,i+1)
  if(isInArray(abc,gh)==true){
    if(isInArray(abc,diaoyongzifuchuang.substring(i-1,i))==false){
      var ygblqiw=i
    }
    if(isInArray(abc,diaoyongzifuchuang.substring(i+1,i+2))==false){
      if(diaoyongzifuchuang.substring(i+1,i+2)=="("){}else{
        var ygblhiw=i+1
        if(isInArray(bllb,diaoyongzifuchuang.substring(ygblqiw,ygblhiw))==false){
          bllb.push(diaoyongzifuchuang.substring(ygblqiw,ygblhiw))
        }
      }
    }
  }
}

var blclb=[]
for(var du=0;du<bllb.length;du++){         //按变量名长度重组
  blclb.push(bllb[du].length+"|"+du)
}
blclb = blclb.sort(function(a,b){
  return Number(b.split("|")[0].length)-Number(a.split("|")[0].length)
})
//l(blclb)
for(var du=0;du<blclb.length;du++){
  blclb.splice(du,1,blclb[du].split("|")[1])
}
//l(blclb)
//l(bllb,blmlb)

for(var gt=0;gt<zuokuohao+1;gt++){          //拆括号
  var qianmdkh=0
  for(var i=0;i<diaoyongzifuchuang.length;i++){
    var gh=diaoyongzifuchuang.substring(i,i+1)
    if(gh=="("){
      var qianmdkh=i
    }
    if(gh==")"){
      var tj=diaoyongzifuchuang.substring(qianmdkh+1,i)
      //console.log(tj)
      var tj=tj.replace(new RegExp('pi', 'g'), String(Math.PI));  //替换常数
      var tj=tj.replace(new RegExp('e', 'g'), String(Math.E));
      var tj=tj.replace(new RegExp('ol', 'g'), String(olhs));
      var tj=tj.replace(new RegExp('et', 'g'), String(EmbreeTrefethen));
      var tj=tj.replace(new RegExp('hj', 'g'), String(hjfg));
     
      for(var cccp=blclb.length-1;cccp>=0;cccp--){                  //替换变量
        var ccccp=blclb[cccp]
        var tj=tj.replace(new RegExp(bllb[ccccp], 'g'), String(blmlb[ccccp]));
      }
      //console.log(tj)
      var jg=String(zijisuan(tj))       //计算子解析式
      function zijisuan(ho){    //计算字符串
        var jo=ho
        var ysfh=[["^"],["*","/"],["+","_"]]      //运算顺序
        var ysfh2=["^","*","/","+","_"]
        var jsshuzi1=0
        var jsshuzi2=0

        var jiscs=0
for(var i=0;i<jo.length;i++){ //获取运算次数
    var gh=jo.substring(i,i+1)
    if(isInArray(ysfh2,gh)==true){  //运算符号
        jiscs++
    }
}


for(var lj=0;lj<ysfh.length;lj++){

  for(var p=0;p<jiscs;p++){        

    for(var i=0;i<jo.length;i++){
        var gh=jo.substring(i,i+1)    //获取运算符

        if(isInArray(ysfh[lj],gh)==true){  //运算
        //console.log( gh)
            for(var t=1;t<1000;t++){       //获取运算数字1
                var de=jo.substring(i-t,i-t+1)
                if(isInArray(num,de)==false){
                    var jsshuzi1=Number(jo.substring(i-t+1,i)) 
                    //console.log(jo.substring(i-t+1,i))
                    var txqz=i-t+1
                    break
                }
            }
            for(var t=1;t<1000;t++){                //获取运算数字2
                var de=jo.substring(i+t,i+t+1)
                if(isInArray(num,de)==false){
                //    console.log(jo.substring(i+1,i+t))
                    var jsshuzi2=Number(jo.substring(i+1,i+t))
                    var txhz=i+t
                    break
                }
            }
            //console.log(jsshuzi1, jsshuzi2)
            
            
            if(gh=="^"){var jsjg=Math.pow(jsshuzi1, jsshuzi2)}  //计算
            if(gh=="*"){var jsjg=accMul(jsshuzi1, jsshuzi2)}
            if(gh=="/"){var jsjg=accDiv(jsshuzi1, jsshuzi2)}
            if(gh=="+"){var jsjg=accAdd(jsshuzi1, jsshuzi2)}
            if(gh=="_"){var jsjg=accSub(jsshuzi1, jsshuzi2)}
          
        jo=jo.substring(0,txqz)+jsjg+jo.substring(txhz,jo.length)
        //console.log(jo)
        break
    }
        //console.log(jo)
    }
}
}
        //console.log(jo)
        return  Number(jo)
    }
      if(isInArray(abc,diaoyongzifuchuang.substring(qianmdkh-1,qianmdkh)) ==true){         //这是函数
          var zshs=true
          var hanshumc=diaoyongzifuchuang.substring(qianmdkh-2,qianmdkh)
          jg=Number(jg)
          if(hanshumc=="ln"){var jg=azln(jg)}
          if(hanshumc=="lo"){var jg=Math.log(jg)} 
          if(hanshumc=="si"){var jg=Math.sin(jg)} 
          if(hanshumc=="co"){var jg=Math.cos(jg)} 
          if(hanshumc=="ta"){var jg=Math.tan(jg)} 
          if(hanshumc=="as"){var jg=Math.arcsin(jg)} 
          if(hanshumc=="ac"){var jg=Math.arccos(jg)} 
          if(hanshumc=="at"){var jg=Math.arctan(jg)} 
          if(hanshumc=="ab"){var jg=Math.abs(jg)} 
          if(hanshumc=="sq"){var jg=Math.sqrt(jg)} 
          if(hanshumc=="gm"){var jg=gmu(jg)} 


         jg=String(jg)
      }

      if(zshs==true){               //替换计算的结果               (1+(3*5))  →  (1+15)
          var zshs=false
          diaoyongzifuchuang=diaoyongzifuchuang.substring(0,qianmdkh-2)+jg+diaoyongzifuchuang.substring(i+1,diaoyongzifuchuang.length)
      }else{
          diaoyongzifuchuang=diaoyongzifuchuang.substring(0,qianmdkh)+jg+diaoyongzifuchuang.substring(i+1,diaoyongzifuchuang.length)
      }
      //console.log(diaoyongzifuchuang)
      break
    }
}
}
//console.log(x,Number(diaoyongzifuchuang))
    return Number(diaoyongzifuchuang)

    }


    function isInArray(arr,value){                                //数组是否包含
        for(var i = 0; i < arr.length; i++){
            if(value === arr[i]){
                return true;
            }
        }
        return false;
    }
    function arrremove(arr, item) {                       //数组删除
        for(var i=arr.length-1;i>=0;i--)
          {
           if(arr[i]==item)
             {
               arr.splice(i,1);
              }
           }
        return arr;
    }
    function lft(x){  //立方体函数
        return accDiv(jx(x+2), accMul(6, jx(x-1)))     //(x+2)!/(6*(x-1)!)
    }
  
function gmu(x){       //伽马函数
  var ds=0
  var dx=0.01
  for(var n=0;n<100;n=n+dx){
var c=Math.pow(n,2*x-1)*Math.pow(Math.E,(-1*n*n))*dx
    var ds=ds+c
  }
  return 2*ds
}



function az_en_cn(src){    //啊这翻译 英译中
    var sc=""
    for(var t=0;t<src.split(" ").length;t++){
        var dc=src.split(" ")[t]
        var pp=false
        for(var f=0;f<en.length;f++){
            if(dc==en[f]){
                sc=sc+cn[f]
                var pp=true
                break
            }
        }
        if(pp==false){
          for(var g=0;g<py.length;g++){
            if(dc==py[g]){
                sc=sc+py[g+1]
                var pp=true
                break
            }
        }
        }
        if(pp==false){
          sc=sc+dc
        }
    }
    return sc
    
}
function az_cn_en(src){         //啊这翻译 中译英
    var sc=""
    for(var h=0;h<src.length;h++){
        var qm=[]
        var ql=[]
        for(var cc=1;cc<9;cc++){
            var dc=src.substring(h,h+cc)
            for(var f=0;f<cn.length;f++){
              if(cn[f].indexOf(dc)==-1){}else{    //权 加一
                  if(isInArray(qm,cn[f])==true){
                    for(var v=0;v<qm.length;v++){
                        if(cn[f]==qm[v]){
                           break
                        }
                    }
                    var ysq=ql[v]
                    //console.log(qm,ql,cn[f],ysq,v)
                    ysq++
                    ql.splice(v,1,ysq)
                    //console.log(qm,ql)
                  }else{
                      qm.push(cn[f])
                      ql.push(1)
                  }
              }
            }
        }
        //console.log(qm,ql)
        var io=0
        for(var s=0;s<ql.length;s++){
            if(ql[s]>ql[s-1]){
                var io=s
                break
            }
        }
        var mc=qm[io]
        if(mc==undefined){
          if(isInArray(abc,src.substring(h,h+1))==true){
            var sc=sc+src.substring(h,h+1)+" "
          }else if(isInArray(num,src.substring(h,h+1))==true){
            var sc=sc+src.substring(h,h+1)+" "
          }else{
            var sc=sc+az_hz_py(src.substring(h,h+1))
          }
         }else{
            for(var f=0;f<cn.length;f++){
                if(mc==cn[f]){
                    var sc=sc+en[f]+" "
                    break
                }
            }
                for(var st=0;st<9;st++){
                    if(mc.indexOf(src.substring(h,h+st))==-1){
                        break
                    }
                }
                h=h+st-1-1
         }
        //console.log(mc,sc,st,st-1-1)
    }
    return sc
}


function az_hz_py(src){      //啊这汉字转拼音
  var sc=""
  for(var o=0;o<src.length;o++){
    var w=src.substring(o,o+1)
    for(var f=0;f<py.length;f++){
      if(w==py[f]){
          for(var d=1;d<py.length;d++){
            if(py[f-d].length>1||isInArray(abc,py[f-d])==true){
               sc=sc+ py[f-d]+" "
               break
            }
          }
          break
      }
  }
  }
return sc
}

function qd_fqd(jxs,mod){         //对于最简整式的求导和反向求导
var zfc=jxs
var g=[]
for(var ht=0;ht<zfc.split("+").length;ht++){
  for(var ht2=0;ht2<zfc.split("+")[ht].split("_").length;ht2++){
    if(ht2==0){var fh="+"}
    else{var fh="_"}    //判断符号
    g.push(zfc.split("+")[ht].split("_")[ht2]+"|"+fh)
  }
}
for(var d=0;d<g.length;d++){
  if(g[d].indexOf("^")==-1){
    if(g[d].indexOf("x")==-1){/*常数项*/}else{
      var hou=g[d].substring(0,g[d].indexOf("x")+1)+"^1"+g[d].substring(g[d].indexOf("x")+1,g[d].length)
      g.splice(d,1,hou)
    }
}
  if(g[d].indexOf("x")==-1){/*常数项*/}else{
    if(g[d].indexOf("*")==-1){
      var hou="1*"+g[d]
      g.splice(d,1,hou)
    }
  }
}
var sc="0"
for(var jr=0;jr<g.length;jr++){
  var fh=g[jr].split("|")[1]
  if(g[jr].indexOf("x")==-1){
    if(mod=="qd"){var zihx=""}
    if(mod=="fqd"){var zihx=fh+"("+g[jr].split("|")[0]+"*x)"}
    sc=sc+zihx
  }else{
    var xs=g[jr].split("|")[0].split("*")[0]
    var cs=g[jr].split("|")[0].split("^")[1]
    if(mod=="qd"){var zihx=fh+"("+xs+"*"+cs+"*(x^("+cs+"_1)))"}
    if(mod=="fqd"){var zihx=fh+"("+xs+"*(x^("+cs+"+1)/("+cs+"+1)))"}
    sc=sc+zihx
  }
}
return sc
}
function lglrcz(src){    //拉格朗日插值 输入经过的点坐标 例:(1,1);(2,3);(4,5)...
  var x=[]
  var y=[]
  for(var g=0;g<src.split(";").length;g++){
    var x1=src.split(";")[g].split(",")[0].split("(")[1]
    var y1=src.split(";")[g].split(",")[1].split(")")[0]
    x.push(jiexiys( x1))
    y.push(jiexiys( y1))
  }
  //l(x,y)
  var zsc=""
  for(var dijg=0;dijg<src.split(";").length;dijg++){
    var c=""
    var cms=1
    for(var d=0;d<src.split(";").length;d++){
      if(d==dijg){}else{

  var c=c+"(x_"+x[d]+")*"
  var cms=cms*(x[dijg]-x[d])
      }
    }
    var c=c.substring(0,c.length-1)
    zsc=zsc+y[dijg]+"*("+c+"/"+cms+")+"
  }
  var zsc=zsc.substring(0,zsc.length-1)
  return zsc
}












     function accAdd(arg1, arg2) {             //精确加法
        var r1, r2, m, c;
        try {
          r1 = arg1.toString().split(".")[1].length;
        } catch (e) {
          r1 = 0;
        }
        try {
          r2 = arg2.toString().split(".")[1].length;
        } catch (e) {
          r2 = 0;
        }
        c = Math.abs(r1 - r2);
        m = Math.pow(10, Math.max(r1, r2));
        if (c > 0) {
          var cm = Math.pow(10, c);
          if (r1 > r2) {
            arg1 = Number(arg1.toString().replace(".", ""));
            arg2 = Number(arg2.toString().replace(".", "")) * cm;
          } else {
            arg1 = Number(arg1.toString().replace(".", "")) * cm;
            arg2 = Number(arg2.toString().replace(".", ""));
          }
        } else {
          arg1 = Number(arg1.toString().replace(".", ""));
          arg2 = Number(arg2.toString().replace(".", ""));
        }
        return (arg1 + arg2) / m;
      }
    function accSub(arg1, arg2) {              //精确减法
        var r1, r2, m, n;
        try {
          r1 = arg1.toString().split(".")[1].length;
        } catch (e) {
          r1 = 0;
        }
        try {
          r2 = arg2.toString().split(".")[1].length;
        } catch (e) {
          r2 = 0;
        }
        m = Math.pow(10, Math.max(r1, r2)); //last modify by deeka //动态控制精度长度
        n = (r1 >= r2) ? r1 : r2;
        return ((arg1 * m - arg2 * m) / m).toFixed(n);
      }
    function accMul(arg1, arg2) {          //精确乘法
        var m = 0,
          s1 = arg1.toString(),
          s2 = arg2.toString();
        try {
          m += s1.split(".")[1].length;
        } catch (e) {}
        try {
          m += s2.split(".")[1].length;
        } catch (e) {}
        return Number(s1.replace(".", "")) * Number(s2.replace(".", "")) / Math.pow(10, m);
      }
    function accDiv(arg1, arg2) {        //精确除法
        var t1 = 0,
          t2 = 0,
          r1, r2;
        try {
          t1 = arg1.toString().split(".")[1].length;
        } catch (e) {}
        try {
          t2 = arg2.toString().split(".")[1].length;
        } catch (e) {}
        with(Math) {
          r1 = Number(arg1.toString().replace(".", ""));
          r2 = Number(arg2.toString().replace(".", ""));
          return (r1 / r2) * pow(10, t2 - t1);
        }
      }
      function toCode (str) {  //加密字符串
        //定义密钥，36个字母和数字
        var key = "~`!@#$%^&*()_+}{|?>:<,./;][-=。，‘“”’：";
        var len = key.length;  
        var a = key.split("");  
        var s = "",b, b1, b2, b3;  
        for (var i = 0; i <str.length; i ++) {  
            b = str.charCodeAt(i);  
            b1 = b % len;  
            b = (b - b1) / len;  
            b2 = b % len;  
            b = (b - b2) / len;  
            b3 = b % len;  
            s += a[b3] + a[b2] + a[b1];  
        }
        return s;  
    }
    function fromCode (str) {                 //解密字符串
        //定义密钥，36个字母和数字
        var key = "~`!@#$%^&*()_+}{|?>:<,./;][-=。，‘“”’：";
        var len = key.length;  
        var b, b1, b2, b3, d = 0, s;  
        s = new Array(Math.floor(str.length / 3));  
        b = s.length;  
        for (var i = 0; i < b; i ++) {  
            b1 = key.indexOf(str.charAt(d));  
            d ++;
            b2 = key.indexOf(str.charAt(d));  
            d ++;
            b3 = key.indexOf(str.charAt(d));  
            d ++;
            s[i] = b1 * len * len + b2 * len + b3  
        }
        b = eval("String.fromCharCode(" + s.join(',') + ")");  
        return b ;  
    }
    function zfc_to_sz(lb){             //字符串转数组
      var lssz=[];
      ////console.log(lb)
      if(lb.indexOf("ن")>-1){
          for(var tgh=0;tgh<lb.split("ن").length;tgh++) {
              lssz.push(lb.split("ن")[tgh])
          }
      }else{
          lssz.push(lb)
  
  }
      return lssz
  }
  
  
  function sz_to_zfc(sz){            //数组转字符串
      var lssz="";
      for(var tgh=0;tgh<sz.length-1;tgh++) {
         var lssz=lssz+sz[tgh]+"ن"
      }
      var lssz=lssz+sz[sz.length-1]
  return lssz
  }

  var md5 = function (string) {        //md5
    function RotateLeft(lValue, iShiftBits) {
        return (lValue<<iShiftBits) | (lValue>>>(32-iShiftBits));
    }
    function AddUnsigned(lX,lY) {
        var lX4,lY4,lX8,lY8,lResult;
        lX8 = (lX & 0x80000000);
        lY8 = (lY & 0x80000000);
        lX4 = (lX & 0x40000000);
        lY4 = (lY & 0x40000000);
        lResult = (lX & 0x3FFFFFFF)+(lY & 0x3FFFFFFF);
        if (lX4 & lY4) {
            return (lResult ^ 0x80000000 ^ lX8 ^ lY8);
        }
        if (lX4 | lY4) {
            if (lResult & 0x40000000) {
                return (lResult ^ 0xC0000000 ^ lX8 ^ lY8);
            } else {
                return (lResult ^ 0x40000000 ^ lX8 ^ lY8);
            }
        } else {
            return (lResult ^ lX8 ^ lY8);
        }
    }
    function F(x,y,z) { return (x & y) | ((~x) & z); }
    function G(x,y,z) { return (x & z) | (y & (~z)); }
    function H(x,y,z) { return (x ^ y ^ z); }
    function I(x,y,z) { return (y ^ (x | (~z))); }
    function FF(a,b,c,d,x,s,ac) {
        a = AddUnsigned(a, AddUnsigned(AddUnsigned(F(b, c, d), x), ac));
        return AddUnsigned(RotateLeft(a, s), b);
    };
    function GG(a,b,c,d,x,s,ac) {
        a = AddUnsigned(a, AddUnsigned(AddUnsigned(G(b, c, d), x), ac));
        return AddUnsigned(RotateLeft(a, s), b);
    };
    function HH(a,b,c,d,x,s,ac) {
        a = AddUnsigned(a, AddUnsigned(AddUnsigned(H(b, c, d), x), ac));
        return AddUnsigned(RotateLeft(a, s), b);
    };
    function II(a,b,c,d,x,s,ac) {
        a = AddUnsigned(a, AddUnsigned(AddUnsigned(I(b, c, d), x), ac));
        return AddUnsigned(RotateLeft(a, s), b);
    };
    function ConvertToWordArray(string) {
        var lWordCount;
        var lMessageLength = string.length;
        var lNumberOfWords_temp1=lMessageLength + 8;
        var lNumberOfWords_temp2=(lNumberOfWords_temp1-(lNumberOfWords_temp1 % 64))/64;
        var lNumberOfWords = (lNumberOfWords_temp2+1)*16;
        var lWordArray=Array(lNumberOfWords-1);
        var lBytePosition = 0;
        var lByteCount = 0;
        while ( lByteCount < lMessageLength ) {
            lWordCount = (lByteCount-(lByteCount % 4))/4;
            lBytePosition = (lByteCount % 4)*8;
            lWordArray[lWordCount] = (lWordArray[lWordCount] | (string.charCodeAt(lByteCount)<<lBytePosition));
            lByteCount++;
        }
        lWordCount = (lByteCount-(lByteCount % 4))/4;
        lBytePosition = (lByteCount % 4)*8;
        lWordArray[lWordCount] = lWordArray[lWordCount] | (0x80<<lBytePosition);
        lWordArray[lNumberOfWords-2] = lMessageLength<<3;
        lWordArray[lNumberOfWords-1] = lMessageLength>>>29;
        return lWordArray;
    };
    function WordToHex(lValue) {
        var WordToHexValue="",WordToHexValue_temp="",lByte,lCount;
        for (lCount = 0;lCount<=3;lCount++) {
            lByte = (lValue>>>(lCount*8)) & 255;
            WordToHexValue_temp = "0" + lByte.toString(16);
            WordToHexValue = WordToHexValue + WordToHexValue_temp.substr(WordToHexValue_temp.length-2,2);
        }
        return WordToHexValue;
    };
    function Utf8Encode(string) {
        string = string.replace(/\r\n/g,"\n");
        var utftext = "";
        for (var n = 0; n < string.length; n++) {
            var c = string.charCodeAt(n);
            if (c < 128) {
                utftext += String.fromCharCode(c);
            }
            else if((c > 127) && (c < 2048)) {
                utftext += String.fromCharCode((c >> 6) | 192);
                utftext += String.fromCharCode((c & 63) | 128);
            }
            else {
                utftext += String.fromCharCode((c >> 12) | 224);
                utftext += String.fromCharCode(((c >> 6) & 63) | 128);
                utftext += String.fromCharCode((c & 63) | 128);
            }
        }
        return utftext;
    };
    var x=Array();
    var k,AA,BB,CC,DD,a,b,c,d;
    var S11=7, S12=12, S13=17, S14=22;
    var S21=5, S22=9 , S23=14, S24=20;
    var S31=4, S32=11, S33=16, S34=23;
    var S41=6, S42=10, S43=15, S44=21;
    string = Utf8Encode(string);
    x = ConvertToWordArray(string);
    a = 0x67452301; b = 0xEFCDAB89; c = 0x98BADCFE; d = 0x10325476;
    for (k=0;k<x.length;k+=16) {
        AA=a; BB=b; CC=c; DD=d;
        a=FF(a,b,c,d,x[k+0], S11,0xD76AA478);
        d=FF(d,a,b,c,x[k+1], S12,0xE8C7B756);
        c=FF(c,d,a,b,x[k+2], S13,0x242070DB);
        b=FF(b,c,d,a,x[k+3], S14,0xC1BDCEEE);
        a=FF(a,b,c,d,x[k+4], S11,0xF57C0FAF);
        d=FF(d,a,b,c,x[k+5], S12,0x4787C62A);
        c=FF(c,d,a,b,x[k+6], S13,0xA8304613);
        b=FF(b,c,d,a,x[k+7], S14,0xFD469501);
        a=FF(a,b,c,d,x[k+8], S11,0x698098D8);
        d=FF(d,a,b,c,x[k+9], S12,0x8B44F7AF);
        c=FF(c,d,a,b,x[k+10],S13,0xFFFF5BB1);
        b=FF(b,c,d,a,x[k+11],S14,0x895CD7BE);
        a=FF(a,b,c,d,x[k+12],S11,0x6B901122);
        d=FF(d,a,b,c,x[k+13],S12,0xFD987193);
        c=FF(c,d,a,b,x[k+14],S13,0xA679438E);
        b=FF(b,c,d,a,x[k+15],S14,0x49B40821);
        a=GG(a,b,c,d,x[k+1], S21,0xF61E2562);
        d=GG(d,a,b,c,x[k+6], S22,0xC040B340);
        c=GG(c,d,a,b,x[k+11],S23,0x265E5A51);
        b=GG(b,c,d,a,x[k+0], S24,0xE9B6C7AA);
        a=GG(a,b,c,d,x[k+5], S21,0xD62F105D);
        d=GG(d,a,b,c,x[k+10],S22,0x2441453);
        c=GG(c,d,a,b,x[k+15],S23,0xD8A1E681);
        b=GG(b,c,d,a,x[k+4], S24,0xE7D3FBC8);
        a=GG(a,b,c,d,x[k+9], S21,0x21E1CDE6);
        d=GG(d,a,b,c,x[k+14],S22,0xC33707D6);
        c=GG(c,d,a,b,x[k+3], S23,0xF4D50D87);
        b=GG(b,c,d,a,x[k+8], S24,0x455A14ED);
        a=GG(a,b,c,d,x[k+13],S21,0xA9E3E905);
        d=GG(d,a,b,c,x[k+2], S22,0xFCEFA3F8);
        c=GG(c,d,a,b,x[k+7], S23,0x676F02D9);
        b=GG(b,c,d,a,x[k+12],S24,0x8D2A4C8A);
        a=HH(a,b,c,d,x[k+5], S31,0xFFFA3942);
        d=HH(d,a,b,c,x[k+8], S32,0x8771F681);
        c=HH(c,d,a,b,x[k+11],S33,0x6D9D6122);
        b=HH(b,c,d,a,x[k+14],S34,0xFDE5380C);
        a=HH(a,b,c,d,x[k+1], S31,0xA4BEEA44);
        d=HH(d,a,b,c,x[k+4], S32,0x4BDECFA9);
        c=HH(c,d,a,b,x[k+7], S33,0xF6BB4B60);
        b=HH(b,c,d,a,x[k+10],S34,0xBEBFBC70);
        a=HH(a,b,c,d,x[k+13],S31,0x289B7EC6);
        d=HH(d,a,b,c,x[k+0], S32,0xEAA127FA);
        c=HH(c,d,a,b,x[k+3], S33,0xD4EF3085);
        b=HH(b,c,d,a,x[k+6], S34,0x4881D05);
        a=HH(a,b,c,d,x[k+9], S31,0xD9D4D039);
        d=HH(d,a,b,c,x[k+12],S32,0xE6DB99E5);
        c=HH(c,d,a,b,x[k+15],S33,0x1FA27CF8);
        b=HH(b,c,d,a,x[k+2], S34,0xC4AC5665);
        a=II(a,b,c,d,x[k+0], S41,0xF4292244);
        d=II(d,a,b,c,x[k+7], S42,0x432AFF97);
        c=II(c,d,a,b,x[k+14],S43,0xAB9423A7);
        b=II(b,c,d,a,x[k+5], S44,0xFC93A039);
        a=II(a,b,c,d,x[k+12],S41,0x655B59C3);
        d=II(d,a,b,c,x[k+3], S42,0x8F0CCC92);
        c=II(c,d,a,b,x[k+10],S43,0xFFEFF47D);
        b=II(b,c,d,a,x[k+1], S44,0x85845DD1);
        a=II(a,b,c,d,x[k+8], S41,0x6FA87E4F);
        d=II(d,a,b,c,x[k+15],S42,0xFE2CE6E0);
        c=II(c,d,a,b,x[k+6], S43,0xA3014314);
        b=II(b,c,d,a,x[k+13],S44,0x4E0811A1);
        a=II(a,b,c,d,x[k+4], S41,0xF7537E82);
        d=II(d,a,b,c,x[k+11],S42,0xBD3AF235);
        c=II(c,d,a,b,x[k+2], S43,0x2AD7D2BB);
        b=II(b,c,d,a,x[k+9], S44,0xEB86D391);
        a=AddUnsigned(a,AA);
        b=AddUnsigned(b,BB);
        c=AddUnsigned(c,CC);
        d=AddUnsigned(d,DD);
    }
    var temp = WordToHex(a)+WordToHex(b)+WordToHex(c)+WordToHex(d);
    return temp.toLowerCase();
}

      function l(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,r,s,t,u,v,w,x,y,z){  //console.log()
        console.log(a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,r,s,t,u,v,w,x,y,z)
      }












      function px(blclb){
      return blclb.sort(function(a,b){
        return a-b
    })
    }
    function pjs(c,cd){
      var y=0
      for(var d=0;d<c.length;d++){
       y=y+jiexiys(c[d])
      }
      return y/cd
    }